## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
inputs.tf
```
```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      NAME                      |
|--------|------------------------------------------------|
| update | `aws_ecs_service.saas-procurement-app-service` |
| add    | `aws_ecs_task_definition.saas_procurement`     |
|        | `aws_security_group_rule.ecs_egress_database`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ecs_service.saas-procurement-app-service will be updated in-place
  ~ resource "aws_ecs_service" "saas-procurement-app-service" {
        id                                 = "arn:aws:ecs:ca-central-1:394954348146:service/saas-procurement-cluster/saas_procurement-service"
        name                               = "saas_procurement-service"
        tags                               = {
            "CostCentre" = "saas-procurement"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:394954348146:task-definition/saas-procurement-task:12" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.saas_procurement will be created
  + resource "aws_ecs_task_definition" "saas_procurement" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + image            = "394954348146.dkr.ecr.ca-central-1.amazonaws.com/saas-procurement:latest"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/saas-procurement-app"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "ecs-saas_procurement"
                        }
                    }
                  + name             = "saas-procurement"
                  + portMappings     = [
                      + {
                          + appProtocol   = "http"
                          + containerPort = 8000
                          + hostPort      = 8000
                          + name          = "saas-procurement-8000-tcp"
                          + protocol      = "tcp"
                        },
                    ]
                  + ulimits          = [
                      + {
                          + hardLimit = 1000000
                          + name      = "nofile"
                          + softLimit = 1000000
                        },
                    ]
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::394954348146:role/saas_procurement-task-role"
      + family                   = "saas-procurement-task"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = "arn:aws:iam::394954348146:role/saas_procurement-task-role"

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # aws_security_group_rule.ecs_egress_database will be created
  + resource "aws_security_group_rule" "ecs_egress_database" {
      + description              = "Allow ECS to talk to the RDS cluster"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0d1ca7e7e561a219f"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-051638cd60aef88c3"
      + to_port                  = 5432
      + type                     = "egress"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.saas_procurement_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.saas_procurement"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.saas-procurement-app-service"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.saas_procurement"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]

26 tests, 17 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
